public class Zadanie {
        public static void main(String[] args) {
                //Продвинутый
                // Задание №1: Написать цикл, который будет прибавлять число к result до тех пор,
                // пока не получиться больше 1_000_000.
                // Дано:
                double increment = 0.01123;
                double result = 0;
                long count = 0;
                // Вывести на экран, количество итераций, которое потребовалось, чтобы дойти до миллиона.
                // Если число отрицательное, то сразу заканчиваем цикл, ничего не выводя.
                // Внимание: число может измениться, и не должно приводить к изменению вашего кода.


                // Задание №2: Дан массив единиц, произвольной длины. Создать цикл, который заменяет каждый
                // нечетный элемент на 0;
                // Например, дано: [1,1,1,1,1]
                // Ожидаемый результат: [0,1,0,1,0]
                // Подсказка: прочитай про операнд "%".


                //Задача №3
                //Создать два массив чисел:
                // 1,2,5,7,10
                // 2,3,2,17,15
                // Создать массив чисел, в котором будут: все числа из этих двух массивов,
                // и результат умножения чисел с одинаковым порядковым номером
                //
                //Ожидаемый результат:
                //1,2,5,7,10,2,3,2,17,15,2,6,10,119,150
                //(первый массив - 1,2,5,7,10), (второй массив - 2,3,2,17,15),
                //(результат перемножения - (1*2), (2*3), (5*2), (7*17), (10*15)


                //Задача №4
                //В строке "Hello world!" заменить l на r, сделать все буквы заглавными, выбрать первые 8 символов

        }
}